In [1]:
import pandas

In [2]:
pandas.read_excel?

In [26]:
df=pandas.read_excel("master_nodes.xlsx",sheetname="Nodes")

In [27]:
import openpyxl
pandas.ExcelWriter?
df.to_excel?

In [22]:
df

,FROM,TO,FROM NODE ID,TO NODE ID,FROM NODE TYPE,TO NODE TYPE,LINK ID,Distance,AMPLIFIERS NODES,AMPLIFIERS TYPE
0,Hyderabad,Vishakapatnam,2,7,S,S,12,100,None,None
1,Mumbai,Pune,3,8,M,M,13,200,None,None
2,Chennai,Thanjavur,4,9,T,T,14,300,None,None
3,Kochi,Coimbatore,5,10,S,S,15,400,None,None
4,Bengaluru,Mysuru,1,6,L,L,11,500,"Ramanagara, Madduru","A, B"

In [23]:
Writer = pandas.ExcelWriter("master_nodes.xlsx",engine='xlsxwriter')
df.to_excel(Writer,sheet_name="Nodes_metadata")
Writer.save()

In [30]:
import pandas
from openpyxl import load_workbook

book = load_workbook('master_nodes.xlsx')
writer = pandas.ExcelWriter('master_nodes.xlsx', engine='openpyxl') 
writer.book = book
writer.sheets = dict((ws.title, ws) for ws in book.worksheets)
df.to_excel(writer, "Nodes_metadata")
writer.save()

In [59]:
df=pandas.read_excel("master_nodes.xlsx",sheetname="Nodes_metadata")

In [60]:
df

,FROM_EDITED,TO_EDITED,FROM_COORDINATES,TO_COORDINATES
0,"Hyderabad, India","Vishakapatnam, India","[17.41500345, 78.4193658848225]","[17.72131135, 83.2900511199386]"
1,"Mumbai, India","Pune, India","[18.9321862, 72.8308337]","[18.5203062, 73.8543185]"
2,"Chennai, India","Thanjavur, India","[13.0801721, 80.2838331]","[10.7860689, 79.1381282]"
3,"Kochi, India","Coimbatore, India","[9.9633864, 76.2536614]","[11.0018115, 76.9628425]"
4,"Bengaluru, India","Mysuru, India","[12.9791198, 77.5912997]","[12.3051828, 76.6553609]"

In [33]:
df=pandas.read_excel("master_nodes.xlsx",sheetname="Nodes")

In [34]:
df

,FROM,TO,FROM NODE ID,TO NODE ID,FROM NODE TYPE,TO NODE TYPE,LINK ID,Distance,AMPLIFIERS NODES,AMPLIFIERS TYPE
0,Hyderabad,Vishakapatnam,2,7,S,S,12,100,None,None
1,Mumbai,Pune,3,8,M,M,13,200,None,None
2,Chennai,Thanjavur,4,9,T,T,14,300,None,None
3,Kochi,Coimbatore,5,10,S,S,15,400,None,None
4,Bengaluru,Mysuru,1,6,L,L,11,500,"Ramanagara, Madduru","A, B"

In [61]:
df_metadata = pandas.read_excel("master_nodes.xlsx",sheetname="Nodes_metadata")

In [62]:
df_metadata

,FROM_EDITED,TO_EDITED,FROM_COORDINATES,TO_COORDINATES
0,"Hyderabad, India","Vishakapatnam, India","[17.41500345, 78.4193658848225]","[17.72131135, 83.2900511199386]"
1,"Mumbai, India","Pune, India","[18.9321862, 72.8308337]","[18.5203062, 73.8543185]"
2,"Chennai, India","Thanjavur, India","[13.0801721, 80.2838331]","[10.7860689, 79.1381282]"
3,"Kochi, India","Coimbatore, India","[9.9633864, 76.2536614]","[11.0018115, 76.9628425]"
4,"Bengaluru, India","Mysuru, India","[12.9791198, 77.5912997]","[12.3051828, 76.6553609]"

In [52]:
df_metadata["FROM_EDITED"] = df["FROM"] + ", India"
df_metadata["TO_EDITED"] = df["FROM"] + ", India"

In [65]:
df_metadata.loc[1,"FROM_COORDINATES"]

'[18.9321862, 72.8308337]'

In [55]:
book = load_workbook('master_nodes.xlsx')
writer = pandas.ExcelWriter('master_nodes.xlsx', engine='openpyxl')
writer.book = book
writer.sheets = dict((ws.title, ws) for ws in book.worksheets)
df_metadata.to_excel(writer, "Nodes_metadata")
writer.save()

In [56]:
df

,FROM,TO,FROM NODE ID,TO NODE ID,FROM NODE TYPE,TO NODE TYPE,LINK ID,Distance,AMPLIFIERS NODES,AMPLIFIERS TYPE
0,Hyderabad,Vishakapatnam,2,7,S,S,12,100,None,None
1,Mumbai,Pune,3,8,M,M,13,200,None,None
2,Chennai,Thanjavur,4,9,T,T,14,300,None,None
3,Kochi,Coimbatore,5,10,S,S,15,400,None,None
4,Bengaluru,Mysuru,1,6,L,L,11,500,"Ramanagara, Madduru","A, B"

In [57]:
df_metadata

        FROM_EDITED         TO_EDITED
0  Hyderabad, India  Hyderabad, India
1     Mumbai, India     Mumbai, India
2    Chennai, India    Chennai, India
3      Kochi, India      Kochi, India
4  Bengaluru, India  Bengaluru, India

In [58]:
df_metadata.apply?

In [67]:
df = pandas.read_excel("master_nodes.xlsx",sheetname="Nodes")

In [72]:
df_m = pandas.read_excel("master_nodes.xlsx",sheetname="Nodes_metadata")

In [73]:
df

,FROM,TO,FROM NODE ID,TO NODE ID,FROM NODE TYPE,TO NODE TYPE,LINK ID,Distance,AMPLIFIERS NODES,AMPLIFIERS TYPE
0,Hyderabad,Vishakapatnam,2,7,S,S,12,100,None,None
1,Mumbai,Pune,3,8,M,M,13,200,None,None
2,Chennai,Thanjavur,4,9,T,T,14,300,None,None
3,Kochi,Coimbatore,5,10,S,S,15,400,None,None
4,Bengaluru,Mysuru,1,6,L,L,11,500,"Ramanagara, Madduru","A, B"

In [74]:
df_m

,FROM_EDITED,TO_EDITED,FROM_COORDINATES,TO_COORDINATES
0,"Hyderabad, India","Vishakapatnam, India","[17.41500345, 78.4193658848225]","[17.72131135, 83.2900511199386]"
1,"Mumbai, India","Pune, India","[18.9321862, 72.8308337]","[18.5203062, 73.8543185]"
2,"Chennai, India","Thanjavur, India","[13.0801721, 80.2838331]","[10.7860689, 79.1381282]"
3,"Kochi, India","Coimbatore, India","[9.9633864, 76.2536614]","[11.0018115, 76.9628425]"
4,"Bengaluru, India","Mysuru, India","[12.9791198, 77.5912997]","[12.3051828, 76.6553609]"

In [80]:
X = df_m.ix[0,"FROM_COORDINATES"]

In [81]:
list(X)

['[',
 '1',
 '7',
 '.',
 '4',
 '1',
 '5',
 '0',
 '0',
 '3',
 '4',
 '5',
 ',',
 ' ',
 '7',
 '8',
 '.',
 '4',
 '1',
 '9',
 '3',
 '6',
 '5',
 '8',
 '8',
 '4',
 '8',
 '2',
 '2',
 '5',
 ']']

In [132]:
X = '[17.41500345, 78.4193658848225]'

In [133]:
X = X.split("[")
X = X[1].split("]")
X = X[0].split(",")
X

['17.41500345', ' 78.4193658848225']

In [126]:
X=X[1].split("]")
X

['17.41500345, 78.4193658848225', '']

In [128]:
X

['17.41500345, 78.4193658848225', '']

In [130]:
X = X[0].split(",")

In [131]:
X

['17.41500345', ' 78.4193658848225']

In [96]:
Y

In [134]:
Z = "17.41500345, 78.4193658848225"

In [135]:
Z.split(",")

['17.41500345', ' 78.4193658848225']

In [1]:
import folium

In [137]:
folium.Icon?

In [2]:
dir(folium)

['CircleMarker',
 'ClickForMarker',
 'ColorMap',
 'CssLink',
 'CustomIcon',
 'Div',
 'DivIcon',
 'Element',
 'FeatureGroup',
 'Figure',
 'FitBounds',
 'GeoJson',
 'Html',
 'IFrame',
 'Icon',
 'JavascriptLink',
 'LatLngPopup',
 'LayerControl',
 'LinearColormap',
 'Link',
 'MacroElement',
 'Map',
 'Marker',
 'MarkerCluster',
 'PolyLine',
 'Popup',
 'RegularPolygonMarker',
 'StepColormap',
 'TileLayer',
 'TopoJson',
 'Vega',
 'WmsTileLayer',
 '__all__',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__file__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 'absolute_import',
 'features',
 'folium',
 'map']

In [5]:
folium.LatLngPopup?